
Функция ОбработкаЯвляетсяВстроеннойВКонфигурацию() Экспорт

	ПолноеИмяТекущейОбработки = ЭтотОбъект.Метаданные().ПолноеИмя();
	ВстроеннаяВКонфигурациюОбработка = Метаданные.НайтиПоПолномуИмени(ПолноеИмяТекущейОбработки);

	ОбработкаВстроеннаяВСоставКонфигурации = НЕ (ВстроеннаяВКонфигурациюОбработка = Неопределено);

	Возврат ОбработкаВстроеннаяВСоставКонфигурации;

КонецФункции

Процедура Инициализация()

	ЭтоВстроеннаяОбработка = ОбработкаЯвляетсяВстроеннойВКонфигурацию();
	
КонецПроцедуры

Инициализация();